In [1]:
import numpy as np
import pandas as pd

In [25]:
My_Data=pd.read_csv('Cardio-Good-Fitness.csv')

In [26]:
My_Data.head()

  Product  Age  Gender  Education MaritalStatus  Usage  Fitness  Income  Miles
0   TM195   18    Male         14        Single      3        4   29562    112
1   TM195   19    Male         15        Single      2        3   31836     75
2   TM195   19  Female         14     Partnered      4        3   30699     66
3   TM195   19    Male         12        Single      3        3   32973     85
4   TM195   20    Male         13     Partnered      4        2   35247     47

In [4]:
print(My_Data)

    Product  Age  Gender  Education MaritalStatus  Usage  Fitness  Income  \
0     TM195   18    Male         14        Single      3        4   29562
1     TM195   19    Male         15        Single      2        3   31836
2     TM195   19  Female         14     Partnered      4        3   30699
3     TM195   19    Male         12        Single      3        3   32973
4     TM195   20    Male         13     Partnered      4        2   35247
..      ...  ...     ...        ...           ...    ...      ...     ...
175   TM798   40    Male         21        Single      6        5   83416
176   TM798   42    Male         18        Single      5        4   89641
177   TM798   45    Male         16        Single      5        5   90886
178   TM798   47    Male         18     Partnered      4        5  104581
179   TM798   48    Male         18     Partnered      4        5   95508

     Miles
0      112
1       75
2       66
3       85
4       47
..     ...
175    200
176    200
177    160
178    120
179    180

[180 rows x 9 columns]

In [5]:
My_Data.head(2)

  Product  Age Gender  Education MaritalStatus  Usage  Fitness  Income  Miles
0   TM195   18   Male         14        Single      3        4   29562    112
1   TM195   19   Male         15        Single      2        3   31836     75

In [6]:
My_Data.head(4)

  Product  Age  Gender  Education MaritalStatus  Usage  Fitness  Income  Miles
0   TM195   18    Male         14        Single      3        4   29562    112
1   TM195   19    Male         15        Single      2        3   31836     75
2   TM195   19  Female         14     Partnered      4        3   30699     66
3   TM195   19    Male         12        Single      3        3   32973     85

In [7]:
# Describe the raw data. Find out the mean, median, StandardDeviation, 25%, 50% ,75% value in the data
My_Data.describe()

,Age,Education,Usage,Fitness,Income,Miles
count,180.000000,180.000000,180.000000,180.000000,180.000000,180.000000
mean,28.788889,15.572222,3.455556,3.311111,53719.577778,103.194444
std,6.943498,1.617055,1.084797,0.958869,16506.684226,51.863605
min,18.000000,12.000000,2.000000,1.000000,29562.000000,21.000000
25%,24.000000,14.000000,3.000000,3.000000,44058.750000,66.000000
50%,26.000000,16.000000,3.000000,3.000000,50596.500000,94.000000
75%,33.000000,16.000000,4.000000,4.000000,58668.000000,114.750000
max,50.000000,21.000000,7.000000,5.000000,104581.000000,360.000000

In [22]:
#Display the datatypes of the columns
My_Data.dtypes

Age               int64
Gender           object
Education         int64
MaritalStatus    object
Usage             int64
Fitness           int64
Income            int64
Miles             int64
dtype: object

In [23]:
My_Data.columns

Index(['Age', 'Gender', 'Education', 'MaritalStatus', 'Usage', 'Fitness',
       'Income', 'Miles'],
      dtype='object')

In [27]:
My_Data.index

RangeIndex(start=0, stop=180, step=1)

In [35]:
#selecting only integer columns
select_dtype=My_Data.select_dtypes(include=['int64'])
print(select_dtype)

     Age  Education  Usage  Fitness  Income  Miles
0     18         14      3        4   29562    112
1     19         15      2        3   31836     75
2     19         14      4        3   30699     66
3     19         12      3        3   32973     85
4     20         13      4        2   35247     47
..   ...        ...    ...      ...     ...    ...
175   40         21      6        5   83416    200
176   42         18      5        4   89641    200
177   45         16      5        5   90886    160
178   47         18      4        5  104581    120
179   48         18      4        5   95508    180

[180 rows x 6 columns]

In [41]:
exclude_column=My_Data.select_dtypes(exclude="int64")
print(exclude_column)

    Product  Gender MaritalStatus
0     TM195    Male        Single
1     TM195    Male        Single
2     TM195  Female     Partnered
3     TM195    Male        Single
4     TM195    Male     Partnered
..      ...     ...           ...
175   TM798    Male        Single
176   TM798    Male        Single
177   TM798    Male        Single
178   TM798    Male     Partnered
179   TM798    Male     Partnered

[180 rows x 3 columns]

In [42]:
My_Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 9 columns):
Product          180 non-null object
Age              180 non-null int64
Gender           180 non-null object
Education        180 non-null int64
MaritalStatus    180 non-null object
Usage            180 non-null int64
Fitness          180 non-null int64
Income           180 non-null int64
Miles            180 non-null int64
dtypes: int64(6), object(3)
memory usage: 12.8+ KB

In [ ]:
import matplotlib.pyplot as plt